debug_infos/20260713_current_best_h11_5_h10_8_plus_h10_only/original/current_submission_h10_only/independent_c100_validation/all3_natural_600/round-0003/run_throughput.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f285ee78a60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-7b0dffe6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-13 05:39:27 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:11<00:00,  5.74s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:13<00:00,  4.39s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  13.17     
Total input tokens:                      19847     
Total generated tokens:                  172       
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         13.06     
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1519.80   
---------------Time to First Token----------------
Mean TTFT (ms):                          1584.19   
Median TTFT (ms):                        1802.18   
P50 TTFT (ms):                           1802.18   
P95 TTFT (ms):                           1810.81   
P99 TTFT (ms):                           1811.57   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.96     
Median TPOT (ms):                        45.11     
P50 TPOT (ms):                           45.11     
P95 TPOT (ms):                           45.12     
P99 TPOT (ms):                           45.12     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.27     
Median ITL (ms):                         45.15     
P50 ITL (ms):                            45.15     
P95 ITL (ms):                            45.38     
P99 ITL (ms):                            46.03     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4122.32   
Median E2EL (ms):                        4564.11   
P50 E2EL (ms):                           4564.11   
P95 E2EL (ms):                           5610.14   
P99 E2EL (ms):                           5703.12   
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7faff7680a60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-452dcbd2-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-13 05:40:21 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:15<00:00,  7.89s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:38<00:00, 12.69s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  38.07     
Total input tokens:                      38677     
Total generated tokens:                  605       
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         15.89     
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1031.76   
---------------Time to First Token----------------
Mean TTFT (ms):                          3270.42   
Median TTFT (ms):                        3568.82   
P50 TTFT (ms):                           3568.82   
P95 TTFT (ms):                           3745.36   
P99 TTFT (ms):                           3761.05   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.61     
Median TPOT (ms):                        45.56     
P50 TPOT (ms):                           45.56     
P95 TPOT (ms):                           45.88     
P99 TPOT (ms):                           45.90     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.38     
Median ITL (ms):                         45.56     
P50 ITL (ms):                            45.56     
P95 ITL (ms):                            46.09     
P99 ITL (ms):                            46.76     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          12422.59  
Median E2EL (ms):                        7884.48   
P50 E2EL (ms):                           7884.48   
P95 E2EL (ms):                           23395.91  
P99 E2EL (ms):                           24774.71  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fc989b40a60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-177fa44f-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-13 05:41:45 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:13<00:00,  6.85s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:35<00:00, 11.90s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  35.70     
Total input tokens:                      64238     
Total generated tokens:                  358       
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         10.03     
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1809.38   
---------------Time to First Token----------------
Mean TTFT (ms):                          6066.71   
Median TTFT (ms):                        6015.89   
P50 TTFT (ms):                           6015.89   
P95 TTFT (ms):                           6316.34   
P99 TTFT (ms):                           6343.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.82     
Median TPOT (ms):                        46.91     
P50 TPOT (ms):                           46.91     
P95 TPOT (ms):                           47.09     
P99 TPOT (ms):                           47.11     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.63     
Median ITL (ms):                         47.11     
P50 ITL (ms):                            47.11     
P95 ITL (ms):                            47.61     
P99 ITL (ms):                            48.25     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11631.84  
Median E2EL (ms):                        9534.44   
P50 E2EL (ms):                           9534.44   
P95 E2EL (ms):                           17608.21  
P99 E2EL (ms):                           18325.87  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/16-32K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_r27_p9_c100_fixed_all3_600/all3_natural_600/round-0003/results/4-8K_throughput/result.json